#include <stdio.h>
#include <math.h>

int main() 
{
	printf("¬ведите координату х первой окружности");
	scanf("%f", x1);
	printf("¬ведите координату y первой окружности");
	scanf("%f", y1);
	printf("¬ведите координату х второй окружности");
	scanf("%f", x2);
	printf("¬ведите координату y второй окружности");
	scanf("%f", y2);
	printf("¬ведите радиус первой окружности");
	scanf("%f", R1);
	printf("¬ведите крадиус второй окружности");
	scanf("%f", R2);
	S = sqrt((x1 - x2) * (x1 - x2) + (y1 - y2) * (y1 - y2));
	if (S > R1 + R2)
		printf("ќкружности не касаютс€");
	if (S == R1 + R2)
		printf("¬нешнее касание окружностей");
	if ((S<R1+R2)&&(S>abs(R1-R2)))
		printf("ќкружности пересекаютс€");
	if (S == abs(R1 - R2))
		printf()


	



	return 0;
}