//Разработать программу «угадай число». В программе должно быть предусмотрено два режима:
//1. Программа загадывает одно число из диапазона от 1 до 1000 (случайно)(включительно);
//Пользователь должен вводить отгадки, на которые программа сообщает – загаданное число больше, меньше, или отгадано(«Вы угадали”).
// Работа завершается, когда пользователь отгадает число.Программа также должна считать число попыток и выводить его в конце работы.
//2. Пользователь загадывает одно число из диапазона от 1 до 1000 (случайно)(включительно)и вводит его.Программа пытается отгадать, выводя на экран отгадки.Пользователь вводит подсказки : > , < , =.
// Работа завершается, когда число отгадано.В конце программы вывести число попыток.
#include <stdio.h>
#include <locale.h>
#include <time.h>
#include <stdlib.h>
int main() {
    int mode = 0, value = 0, numb = rand() % 1001, count = 1;
    char znak = '>';
    setlocale(LC_ALL, "Rus");
    srand((unsigned int)time(0));
    do {
        printf("Выберите режим игры: 1(Пользователь отгадывает число) или 2(Компьютер угадывает Ваше число)\n");
        scanf("%d", &mode);
    } while (mode != 1 && mode != 2);
    if (mode == 1) {
        printf("Программа загадала число...\n");
        printf("Введите значение: ");
        scanf("%d", &value);
        while (numb != value) {
            if (numb > value) {
                printf("Загаданное число '>'\n");
            }
            if (numb < value) {
                printf("Загаданное число '<'\n");
            }
            printf("Введите значение: ");
            scanf("%d", &value);
            count++;
        }
        printf("Вы угадали число!!!\n");
        printf("Ваше количество попыток: %d", count);
        return 0;
    }
    if (mode == 2) {
        int left = 1, right = 1001, value = (right - left) / 2;
        printf("Загадайте число от 1 до 1000:\n ");
        printf("%d\n", numb);
        printf("Вы загадали число '>' или '<' или '=' %d", value); printf("?\n");
        scanf("%*c%c", &znak);
        while (znak != '=') {
            count++;
            switch (znak) {
            case '>':
                left = value;
                value = (right - left) / 2 + value;
                break;
            case '<':
                right = value;
                value = (right - left) / 2 + left;
                break;
            default: break;
            }
            printf("Вы загадали число '>' или '<' или '=' %d", value); printf("?\n");
            scanf("%*c%c", &znak);
        }
        printf("Я молодец, угадал ваше число\n", numb);
        printf("Мое количество попыток: %d", count);
        return 0;
    }
}
