/*
 * фирма умелые ручки выпускает двудверные одежные шкафы
 * состав шкафа:
 * 1) Накладная задняя стенка из двп:
 * Высотой h от 180 до 220 см
 * Шириной w от 80 до 120 см
 * Толщиной 5 мм
 * 2) Две боковины из дсп:
 * Высота h
 * Глубиной d от 50 до 90 см
 * Толщиной 15 мм
 * 3) Накладные верхняя и нижняя крышки из дсп:
 * Шириной w
 * Глубиной d
 * Толщиной 15 мм
 * 4) Две накладные двери из дерева:
 * Высотой h
 * Общей шириной w
 * Толщиной 1 см
 * 5) Внутренние полки через каждые 40 см из дсп:
 * Толщина 15 мм
 * !Найти массу если известна плотность дсп и двп!
 */
#include <stdio.h>
#include <string.h>
int main()
{
    double h, w, d, mass=0, ch_polka=0, height;
    printf("Введите высоту шкафа\n");
    scanf("%lf", &h);
    printf("Введите ширину шкафа\n");
    scanf("%lf", &w);
    printf("Введите глубину шкафа\n");
    scanf("%lf", &d);
    if ((h<180)||(h>220)||(w<80)||(w>120)||(d<50)||(d>90))
    {
        printf ("Ошибка ввода данных\n");
        return 1;
    }
    height=h-3;
    while (height>41.5)
    {
       height=height-40.0 - 1.5; //полка имеет толщину 15 мм и она будет занимать эту длину от общей высоты
       ch_polka=ch_polka+1;
    }
    printf("%.0lf\n",ch_polka);
    mass=mass+(h/100)*(w/100)*(5.0/1000)*800;//масса задней стенки
    mass=mass+2*(h/100)*(d/100)*(15.0/1000)*650;//+масса двух боковых стенок
    mass=mass+((w-2*(15.0/10))/100)*(d/100)*(15.0/1000)*650*(2+ch_polka);
    mass=mass+(h/100)*(w/100)*(1.0/100)*550;
    printf("Масса шкафа = %.2lf кг\n", mass);

    return 0;
}
