#include <stdio.h>
#include <math.h>
#include <locale.h>

void main()
{
	float x1, y1, r1, x2, y2, r2, d; // d-рассто¤ние между центрами окружностей
	setlocale(LC_ALL, "Russian");

	printf("¬ведите координаты первой окружности и ее радиус: ");
	scanf("%f %f %f", &x1, &y1, &r1);
	printf("¬ведите координаты второй окружности и ее радиус: ");
	scanf("%f %f %f", &x2, &y2, &r2);

	d = sqrtf((x1 - x2) * (x1 - x2) + (y1 - y2) * (y1 - y2));

	if ((x1 == x2) && (y1 == y2) && (r1 == r2))
	{
		printf("ќкружности полностью совпадают.\n");
		return;
	}
	if ((x1 == x2) && (y1 == y2) && ((r1 > r2) || (r1 < r2)))
	{
		printf("÷ентры окружностей совпадают, а одна из окружностей лежит в первой.\n");
		return;
	}
	if (d  > (r1 + r2))
	{
		printf("ќкружности не пересекаютс¤ и не касаютс¤, ни одна из окружностей не находитс¤ в другой.\n");
		return;
	}
	if (d == (r1 + r2))
	{
		printf("ќкружности касаютс¤ внешним образом.\n");
		return;
	}
	if (((d + r1) == r2) || ((d + r2) == r1))
	{
		printf("ќкружности касаютс¤, причем одна из окружностей внешне касаетс¤ с другой, т.е. одна лежит внутри второй окружности.\n");
		return;
	}
	if ((d < (r1 - r2)) || (d < (r2 - r1)))
	{
		printf("ќдна окружность находитс¤ внутри другой, и они не пересекаютс¤.\n");
		return;
	}
	if ((d < (r1 + r2)) && (r1 < (d + r2)))
	{
		printf("ќкружности пересекаютс¤ и имеют две общие точки.\n");
		return;
	}
}