#include <stdio.h> 
#include <math.h> 
#include <locale.h> 

void main()
{ 
	float dsp, dvp, der; // ДСП,ДВП,плотность дерева в м3
	float h, w, d; // вводимые пользователем данные: высота в см, ширина в см, глубина в см
	float mz, mb, mk, md, mp, m;//суммы
	float t1, t2, t3, t4;// толщина
	t1 = 0.005f;//сразу выразила в метрах, так как они не вводятся пользователем
	t2 = 0.015f;
	t3 = 0.015f;
	t4 = 0.01f;
        setlocale (LC_ALL, "Russian"); 

	printf ("Введите высоту\n"); 
	scanf ("%f", &h); 
	printf ("Введите ширину\n"); 
	scanf ("%f", &w); 
	printf ("Введите глубину\n"); 
        scanf ("%f", &d); 
	printf ("Введите дсп\n"); 
	scanf ("%f", &dsp); 
	printf ("Введите двп\n"); 
	scanf ("%f", &dvp); 
	printf ("Введите плотность дерева\n"); 
	scanf ("%f", &der); 
	if ((180 < h) && (h < 220) && (80 < w) && (w < 120) && (50 < d) && (d < 90))//сравниваю с см
	{
	  mz = (h/100) * (w/100) * t1 * dvp;// делю высоту,ширину,глубину на 100, таким образом перевожу их в метры
	  mb = 2 * (h/100) * (d/100) * t2 * dsp;
	  mk = 2 * dsp * (w/100) * (d/100) * t3;
	  md = (h/100) * (w/100) * t4 * der;
	  mp = dsp * ((int)(((h/100) - 2 * 0.015) / (0.4 + 0.015))) * ((w/100) - 2 * 0.015) * ((d/100) - 0.005);
	  m = (mz + mb + mk + md + mp) / 100;
	  printf ("Масса шкафа %0.f кг\n",m);
	}
	else 
	   printf ("Введенные значения не соответствуют должным");
}

