#include <stdio.h>
#include <math.h>
#include <locale.h>
void main()
{
	float t, t1, t2, p1, p2, p3, v1, v2, v3, v4, v5, m1, m2, m3, m4, m5, m6;
	int h, w, d, n;
	setlocale(LC_ALL, "Russian");
	printf("Введите высоту задней стенки");
	scanf("%d", &h);
	printf("Введите ширину задней стенки");
	scanf("%d", &w);
	printf("Ведите глубину боковой стенки");
	scanf("%d", &d);
	if ((h < 180) || (h > 220))
	{
	printf("Ошибка");
	return;
	}
	else
	if ((w < 80) || (w > 120))
	{
	printf("Ошибка");
	return;
	}
	else 
	if ((d < 50) || (d > 90))
	{
	printf("Ошибка");
	return;
	}
	else
	{
		t = 0.5; //толщина задней стенки см
		t1 = 1.5; //толщина боковой стенки см
		t2 = 1; //толщина двери см
		p1 = 0.75; //плотность ДСП г/см^3
		p2 = 0.25; //плотность ДВП г/см^3
		p3 = 0.55; //плотность дерева г/см^3
		v1 = h * w * t;
		m1 = v1 * p2; //масса задней стенки г
		v2 = h * d * t1;
		m2 = v2 * p1 * 2; //масса боковых стенок г
		v3 = w * d * t1;
		m3 = v3 * p1 * 2; //масса верхней и нижней крышки г
		v4 = h * w * t2;
		m4 = v4 * p3; //масса дверей г
		n = h / 41.5;
		v5 = d * w * t1; //объем одной полки
		m5 = v5 * p1 * n; //масса всех полок г
		m6 = (m1 + m2 + m3 + m4 + m5) / 1000;
		printf("Масса шкафа в килограммах=""%f", m6);
	}
}
