// Две окружности задаются координатами центров и радиусом,
// определите взаимное расположение этих окружностей
#include <stdio.h>
#include <math.h>

int main() {
    float x1, y1, x2, y2, r1, r2;
    printf("Введите координаты x первой окружности");
    scanf("%f", &x1);
    printf("Введите координаты y первой окружности");
    scanf("%f", &y1);
    printf("Введите радиус первой окружности");
    scanf("%f", &r1);
    printf("Введите координаты x второй окружности");
    scanf("%f", &x2);
    printf("Введите координаты y второй окружности");
    scanf("%f", &y2);
    printf("Введите радиус второй окружности");
    scanf("%f", &r2);

    if (r1>r2)
    {
        if (sqrt((x1-x2)*(x1-x2)+(y1-y2)*(y1-y2))<(r1-r2))
            printf("Одна окружность внутри второй, не пересекаются");
        if ((sqrt((x1-x2)*(x1-x2)+(y1-y2)*(y1-y2))<(r1+r2))&&(sqrt((x1-x2)*(x1-x2)+(y1-y2)*(y1-y2))>(r1-r2)))
            printf("Окружности пересекаются в 2 точках");
        if (sqrt((x1-x2)*(x1-x2)+(y1-y2)*(y1-y2))==(r1+r2))
            printf("Окружности касаются внешне");
        if (sqrt((x1-x2)*(x1-x2)+(y1-y2)*(y1-y2))>(r1+r2))
            printf("Окружности не пересекаются");
        if (sqrt((x1-x2)*(x1-x2)+(y1-y2)*(y1-y2))==(r1-r2))
            printf("Окружности касаются внутренне");
    }
    if (r1<r2)
    {
        if (sqrt((x1-x2)*(x1-x2)+(y1-y2)*(y1-y2))<(r2-r1))
            printf("Одна окружность внутри второй, не пересекаются");
        if (sqrt(((x1-x2)*(x1-x2)+(y1-y2)*(y1-y2))<(r2+r1))&&((sqrt((x1-x2)*(x1-x2)+(y1-y2)*(y1-y2))>(r2-r1))))
            printf("Окружности пересекаются в 2 точках");
        if (sqrt((x1-x2)*(x1-x2)+(y1-y2)*(y1-y2))==(r2+r1))
            printf("Окружности касаются внешне");
        if (sqrt((x1-x2)*(x1-x2)+(y1-y2)*(y1-y2))>(r2+r1))
            printf("Окружности не пересекаются");
        if (sqrt((x1-x2)*(x1-x2)+(y1-y2)*(y1-y2))==(r2-r1))
            printf("Окружности касаются внутренне");
    }
    if (r1==r2)
    {
        if (sqrt((x1-x2)*(x1-x2)+(y1-y2)*(y1-y2))<(r2+r1)&&(sqrt((x1-x2)*(x1-x2)+(y1-y2)*(y1-y2))>(r1-r2)))
            printf("Окружности пересекаются в 2 точках");
        if (sqrt((x1-x2)*(x1-x2)+(y1-y2)*(y1-y2))==(r2+r1))
            printf("Окружности касаются внешне");
        if (sqrt((x1-x2)*(x1-x2)+(y1-y2)*(y1-y2))>(r2+r1))
            printf("Окружности не пересекаются");
        if (sqrt((x1-x2)*(x1-x2)+(y1-y2)*(y1-y2))==(r2-r1))
            printf("Окружности совпадают");
    }
}