#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include <math.h>
#include <locale.h>

void main() 
{
	int rezhim, nkomp = 0, nchel = 0, popitki = 0, gr1 = 1, gr2 = 1000, f = 0; //gr1 и gr2 - границы чисел
	char znak, enter;
	setlocale(LC_ALL, "Russian");
	srand((unsigned int)time(0));
	printf("Добро пожаловать в 'Угадай число'! Выберите режим: вы угадываете число компьютера(введите 1) или компьютер угадывает ваше число(введите 2): \n");
	scanf("%d", &rezhim);
	if ((rezhim != 1) && (rezhim != 2))
	{
		printf("Ошибка в выборе режима");
		return;
	}
	if (rezhim == 1) 
	{
		printf("Задумываю число от 1 до 1000... \n");
		nkomp = gr1 + rand() % (gr2 - gr1);
		printf("Попробуйте угадать его!\n");
		while (nchel != nkomp)
		{
			if (f == 0) printf("Попытка № %d: \n", popitki + 1); //флажок f нужен в ситуации, когда пользователь ошибся при вводе числа, и это не должно считаться за полноценную попытку
			f = 0;
			scanf("%d", &nchel);
			if ((nchel < gr1) || (nchel >= gr2))
			{
				printf("Ошибка, введено число из неверного диапазона. Попробуйте еще раз:\n");
				f = 1; //активация флажка для невыполнения условия из строки 27
				continue;
			}
			if (nchel < nkomp) 
			{
				printf("Ваше число меньше загаданного. Попробуйте еще раз.\n");
				popitki++;
			}
			if (nchel > nkomp) 
			{
				printf("Ваше число больше загаданного. Попробуйте еще раз.\n");
				popitki++;
			}
			if (nchel == nkomp) 
				{
					
					popitki++;
					printf("Поздравляем, вы угадали число c %d попытки(-ок)!!!\n", popitki);
					return;
			    }
		}
	}
	if (rezhim == 2) 
	{
		printf("Загадайте число от 1 до 1000 и введите его:\n");
		scanf("%d", &nchel);
		if ((nchel < gr1) || (nchel > (gr2 - gr1)))
		{
			printf("Ошибка. Введено число из неверного диапазона.\n");
			return;
		}
		printf("Пробую угадать число...\n");
		while (nkomp != nchel)
			{
				if (f == 0) //f - флажок. Нужен для ситуации, когда пользователь случайно ввел не тот знак и не хочет, чтобы генерировалось новое число
				{
					if (gr2 != gr1) //этим условием исключаем ситуацию, когда программа рандомит 2 одинаковых числа подряд
					{
						nkomp = gr1 + rand() % (gr2 - gr1); 
						if (nkomp == gr1) nkomp++;
						if (nkomp == gr2) nkomp--;
					}
					else nkomp = gr2; //в худшем случае получатся 2 одинаковые границы, тогда программа выведет ошибку в 71 строке, так как (gr2-gr1)=0
					printf("Попытка № %d: Моё число: %d. Введите знак сравнения моего числа с загаданным(если мое число больше Вашего, введите '>'; если мое число меньше Вашего, введите '<'; если я угадал, введите '='. \n", popitki + 1, nkomp);
				}
				if (gr1 > gr2) //граница 1 не может быть больше границы 2 при верном вводе
				{
					printf("Введены неправильные знаки. Начните программу заново.\n"); 
					return;
				}
				f = 0;
				scanf("%c", &enter); //без этой сроки программа в переменную znak записывает Enter
				scanf("%c", &znak);
				if(znak == '>') 
				{
					gr2 = nkomp;
					popitki++;
					if (nkomp == gr2) //в случае, когда границы равны и когда введен не знак = программа должна выводить ошибку
					{
						printf("Мне кажется, вы запутались в знаках. Попробуйте все сначала.\n");
						return;
					}
				}
				else if(znak == '<') 
				{
					gr1 = nkomp;
					popitki++;
					if (nkomp == gr2)
					{
						printf("Мне кажется, вы запутались в знаках. Попробуйте все сначала.\n");
						return;
					}
				}
				else if (znak == '=') 
				{
					popitki++;
					printf("Ура! Я угадал Ваше число с %d попытки(-ок)\n", popitki);
					return;		
				}
				else 
				{
					printf("Ошибка, знак введен неверно. Введите еще раз:\n");
					f = 1; //здесь флажок "активируется", чтобы не сработало условие в строке 67
					continue;
				}
				
		    }
	}
}
