#include <stdio.h>

void main()
{
    float r1, r2, R;
    //R- расстояние между центрами окружностей//
    scanf("%f %f %f", &r1, &r2, &R);

    if (r1 == r2)
    {
        printf("Окружности совпадают");
        return;
    }
    if (R > r1 + r2)
    {
        printf("Окружности не пересекаются");
        return;
    }
    if (((R < r1 - r2) && (r1 > r2)) || ((R < r2 - r1) && (r2 > r1)))
    {
        printf("Одна окружность лежит внутри другой, но они не пересекаются");
        return;
    }
    if (((R == r1 - r2) && (r1 > r2)) || ((R == r2 - r1) && (r2 > r1)))
    {
        printf("Одна окружность лежит внутри другой и они касающиеся");
        return;
    }
    if (((r1 > r2) && ((R > r1 - r2) && (R < r1 + r2))) || 
        ((r2 > r1) && ((R > r2 - r1) && (R < r1 + r2))))
    {
        printf("Окружности пересекаются в двух точках");
        return;
    }
    if (R == r1 + r2)
    {
        printf("Окружности пересекаются в одной точке, но не лежат одна в другой ");
        return;
    }
}
