#include <stdio.h>
#include <locale.h>

void main()
{
    float pDSP, pDVP, pWOOD; // плотности
    float h, w, d; // параметры шкафа
    float m; // масса шкафа
    int k; // количество полок
    setlocale(LC_ALL, "Russian");
    printf("Введите плотность ДСП (в кг/м3)\n");
    scanf("%f", &pDSP);
    printf("Введите плотность ДВП (в кг/м3)\n");
    scanf("%f", &pDVP);
    printf("Введите плотность дерева (в кг/м3)\n");
    scanf("%f", &pWOOD);
    printf("Введите высоту шкафа (в см)\n");
    scanf("%f", &h);
    h /= 100;    
    if ((h < 1.8) || (h > 2.2))
    {
        printf("Модели с заданными параметрами не существует");
        return;
    }
    printf("Введите глубину шкафа (в см)\n");
    scanf("%f", &d);
    d /= 100;
    if ((d < 0.5) || (d > 0.9))
    {
        printf("Модели с заданными параметрами не существует");
        return;
    }
    printf("Введите ширину шкафа (в см)\n");
    scanf("%f", &w);
    w /= 100;
    if ((w < 0.8) || (w > 1.2))
    {
        printf("Модели с заданными параметрами не существует");
        return;
    }
    k = (int)(100 * h - 3.0) / 40;
    if (((int)(100 * h) % 40) == 0)
        k--;
    m = pDVP * h * w * 0.005f /*задняя стенка*/
        + pDSP * 2 * h * d * 0.015f/*боковины*/
        + pDSP * 2.0f * w * d * 0.015f/*крышки*/ + pWOOD * h * w * 0.01f/*Двери*/
        + pDSP * (float)k * (d - 0.005f) * (w - 0.03f) * 0.015f/*Полки*/;
    printf("Масса шкафа %1.1f кг\n", m);
}
